[
  {
    "id": "1",
    "title": "Infectious Disease Monitoring & Analytics Platform",
    "description": "Full-stack epidemiological surveillance system with real-time disease tracking, geospatial visualization, and predictive modeling for public health decision-making.",
    "longDescription": "A comprehensive healthcare platform built to monitor and analyze infectious disease outbreaks in real-time. The system provides epidemiologists and health administrators with powerful tools for case management, statistical analysis, and outbreak prediction.\n\nFeatures include interactive geospatial mapping, temporal trend analysis, and SIR/SEIR epidemiological modeling for disease spread simulation. The platform separates public health data visualization from administrative controls, ensuring data privacy while maintaining transparency.\n\nBuilt with modern scalable architecture using NestJS microservices, PostgreSQL for robust data persistence, and React-based dashboards for intuitive user experience.",
    "technologies": [
      "React 19",
      "Next.js 15",
      "TypeScript",
      "Node.js",
      "NestJS",
      "PostgreSQL", 
      "TypeORM",
      "Leaflet.js",
      "Recharts"
    ],
    "features": [
      "Real-time disease case tracking and management",
      "Interactive geospatial heat maps and location markers",
      "Advanced statistical analytics and trend visualization", 
      "Epidemiological modeling (SIR/SEIR) for outbreak prediction",
      "Role-based access control (Admin/Public interfaces)",
      "Temporal data analysis with configurable time intervals",
      "Multi-location disease distribution monitoring",
      "JWT-secured API with comprehensive data validation"
    ],
    "image": "/images/disease7.png",
    "photos": ["/images/disease1.png", "/images/disease2.png", "/images/disease3.png", "/images/disease4.png", "/images/disease5.png", "/images/disease6.png", "/images/disease7.png", "/images/disease8.png", "/images/disease9.png", "/images/disease10.png", "/images/disease11.png"],
    "github": "https://github.com/EduardCirstea/disease-tracker",
    "demo": "https://youtu.be/ln5EPFspVxE",
    "category": "Full Stack",
    "featured": true,
    "completedAt": "2025-02-20"
  },
  {
    "id": "2",
    "title": "SpeedTest Pro - Internet Speed Testing Platform",
    "description": "A modern full-stack speed test application that measures internet performance with real-time testing, user authentication, interactive maps, and comprehensive analytics dashboard.",
    "longDescription": "SpeedTest Pro is a sophisticated web application built for comprehensive internet speed testing and performance monitoring. The project implements a robust client-server architecture with an interactive React/TypeScript frontend and a scalable Node.js backend.\n\nIt utilizes advanced speed measurement algorithms based on Cloudflare's API to deliver precise results for download, upload, latency, and jitter metrics. The application features a complete authentication system with JWT tokens, MongoDB data persistence, and geolocation capabilities for displaying results on an interactive map of Romania.\n\nThe user interface is modern and intuitive, featuring futuristic visual elements, interactive charts, and an optimized UX for all device types. This project demonstrates advanced full-stack development skills, Redux state management, external API integration, and implementation of complex networking and data visualization functionalities.",
    "image": "/images/speedtest3.png",
    "photos": ["/images/speedtest1.png", "/images/speedtest2.png", "/images/speedtest3.png", "/images/speedtest4.png", "/images/speedtest5.png"],
    "features": [
        "Real-time internet speed testing with download/upload measurements",
        "Interactive map visualization with speed test results across Romania",
        "User authentication system with JWT and secure password management", 
        "Personal test history with statistical charts and analytics",
        "Top cities ranking by average internet speed",
        "Responsive modern UI with futuristic design elements",
        "Latency and jitter quality measurements",
        "Geolocation-based automatic location detection",
        "RESTful API with robust error handling",
        "Redux state management with data persistence"
      ],
    "technologies": [
      "React",
      "TypeScript", 
      "Node.js",
      "Express.js",
      "MongoDB",
      "Redux Toolkit",
      "JWT Authentication",
      "Cloudflare API",
      "Leaflet Maps",
      "Chart.js",
      "Recharts",
      "Bcrypt",
      "Axios",
      "React Router",
      "Mongoose",
      "Vite",
      "CSS3"
    ],
    "github": "https://github.com/EduardCirstea/speedtest-app",
    "demo": "https://youtu.be/Otm5BDPseps",
    "category": "Full Stack",
    "featured": true,
    "completedAt": "2024-11-15"
  },
  {
    "id": "3",
    "title": "Full-Stack Social Media Platform",
    "description": "A complete social networking application with real-time interactions, user authentication, and modern responsive design built with React and Node.js.",
    "longDescription": "A comprehensive social media platform that replicates core functionalities of modern social networks. The application features secure user authentication, real-time post interactions, friend management system, and image uploads.\n\nBuilt with a scalable MERN stack architecture, it demonstrates proficiency in full-stack development, RESTful API design, state management, and modern UI/UX principles.\n\nThe platform includes responsive design with dark/light theme switching, JWT-based authentication, and optimized database operations for seamless user experience.",
    "technologies": [
      "React.js",
      "Node.js",
      "Express.js", 
      "MongoDB",
      "Redux Toolkit",
      "Material-UI",
      "JWT Authentication",
      "Multer File Upload"
    ],
    "features": [
      "Secure user authentication and registration with JWT tokens",
      "Real-time social feed with post creation and image uploads",
      "Interactive like and comment system for posts", 
      "Friend management system with add/remove functionality",
      "Responsive user profiles with personal information display",
      "Dark/Light theme switching for enhanced user experience",
      "RESTful API design with protected routes and middleware",
      "Optimized state management using Redux for seamless data flow"
    ],
    "image": "/images/socialmedia1.png",
    "photos": ["/images/socialmedia1.png", "/images/socialmedia2.png", "/images/socialmedia3.png", "/images/socialmedia4.png", "/images/socialmedia5.png"],
    "github": "https://github.com/EduardCirstea/Fullstack-SocialMediaApp",
    "demo": "https://www.youtube.com/watch?v=F6HTUQzfPFA&feature=youtu.be",
    "category": "Backend",
    "featured": false,
    "completedAt": "2023-08-25"
  },
  {
    "id": "4",
    "title": "Invoice Management System",
    "description": "Full-stack web application for automated invoice generation and client management with PDF export capabilities",
    "longDescription": "A comprehensive invoice management solution built for Romanian businesses, featuring automated invoice generation, client management, and financial reporting. The application streamlines the entire invoicing workflow from client registration to PDF generation, with real-time calculations for VAT, totals, and tax handling.\n\nUsers can manage multiple clients, track invoice status (issued/collected), generate professional PDF invoices, and access detailed financial reports.\n\nThe system includes user authentication, role-based access, and a modern responsive interface optimized for business workflows.",
    "technologies": [
      "React.js",
      "Node.js",
      "Redux Toolkit",
      "Express.js",
      "MongoDB",
      "JWT Authentication",
      "Ant Design",
      "PDF Generator"
    ],
    "features": [
      "Automated invoice generation with PDF export",
      "Complete client management system (CRUD operations)",
      "Real-time VAT and total calculations",
      "Invoice status tracking (issued/collected)",
      "Advanced search and filtering capabilities",
      "Financial reporting and analytics dashboard",
      "JWT-based secure authentication",
      "Responsive modern UI with pagination"
    ],
    "image": "/images/invoice1.png",
    "photos": ["/images/invoice1.png", "/images/invoice2.png", "/images/invoice3.png", "/images/invoice4.png", "/images/invoice5.png", "/images/invoice6.png", "/images/invoice7.png"],
    "github": "https://github.com/EduardCirstea/App-facturare/",
    "demo": "https://www.youtube.com/watch?v=EtM1kLm7MTM",
    "category": "Full Stack",
    "featured": false,
    "completedAt": "2023-02-22"
  },
  {
    "id": "5",
    "title": "E-commerce Platform with Headless CMS",
    "description": "Modern e-commerce application built with Next.js and Sanity CMS, featuring real-time inventory management, Stripe payment integration, and responsive design for seamless shopping experiences.",
    "longDescription": "A comprehensive e-commerce solution that demonstrates full-stack development capabilities with modern web technologies. The application features a decoupled architecture using Sanity as a headless CMS for content management, Next.js for the frontend with server-side rendering for optimal SEO performance, and Stripe for secure payment processing.\n\nThe platform includes dynamic product pages, real-time shopping cart functionality with global state management, and a complete admin panel for inventory management.\n\nBuilt with scalability in mind, it showcases advanced React patterns, API integration, and modern development practices suitable for production environments.",
    "technologies": [
      "React",
      "Node.js",
      "JavaScript ES6+",
      "Next.js",
      "CSS3",
        "Sanity CMS",
        "Stripe API",
        "Vercel"
    ],
    "features": [
        "Headless CMS integration with Sanity for dynamic content management",
        "Server-side rendering and static generation for optimal SEO performance",
        "Real-time shopping cart with persistent state management using React Context",
        "Secure payment processing with Stripe Checkout integration",
        "Dynamic product pages with image galleries and detailed views",
        "Responsive design optimized for desktop and mobile devices",
        "Admin dashboard for product and banner management",
        "Toast notifications and loading states for enhanced user experience"
    ],
    "image": "/images/ecommerce1.png",
    "photos": ["/images/ecommerce1.png", "/images/ecommerce2.png", "/images/ecommerce3.png", "/images/ecommerce4.png"],
    "github": "https://github.com/EduardCirstea/Ecommerce_nextjs",
    "demo": "https://www.youtube.com/watch?v=WHAbMjBfA-c",
    "category": "Frontend",
    "featured": false,
    "completedAt": "2022-12-10"
  },
  
    {
      "id": "6",
      "title": "PharmaPlus E-Commerce Platform",
      "description": "A comprehensive pharmaceutical e-commerce platform built with NestJS, featuring advanced inventory management, multi-courier integration, automated billing, and secure payment processing for online pharmacy operations.",
      "longDescription": "PharmaPlus is a robust, enterprise-grade e-commerce solution specifically designed for pharmaceutical retail. The platform handles complex pharmacy requirements including prescription validation, OTC product management, expiration date tracking, and regulatory compliance.\n\nBuilt with modern microservices architecture, it integrates seamlessly with external systems like BizPharma for inventory synchronization, Netopia for secure payments, and multiple courier services (Urgent Cargus, Sameday) for reliable delivery.\n\nThe system features automated invoice generation, email notifications, promotional campaigns, and a comprehensive admin dashboard for order management. With JWT authentication, Google OAuth integration, and role-based access control, it ensures secure operations while providing an intuitive user experience for both customers and administrators.",
      "technologies": [
        "TypeScript",
          "NestJS",
          "TypeORM",
          "MySQL",
          "JWT Authentication",
          "Google OAuth",
          "SendGrid",
          "Netopia Payment Gateway"
      ],
      "features": [
          "Advanced Product Management with OTC/Prescription categorization",
          "Multi-Courier Integration (Urgent Cargus, Sameday) with AWB generation",
          "Automated Invoice Generation and Email Notifications",
          "Real-time Inventory Synchronization with BizPharma",
          "Secure Payment Processing via Netopia Gateway",
          "Comprehensive Order Management with Status Tracking",
          "Blog CMS with Categories and Comment System",
          "Promotional Campaigns and Gift Product Management"
      ],
      "image": "/images/pharma2.png",
      "photos": ["/images/pharma1.png", "/images/pharma2.png"],
      "github": "",
      "demo": "https://pharmaplus-online.ro/",
      "category": "Backend",
      "featured": false,
      "completedAt": "2025-01-12"
    },
    {
      "id": "7",
      "title": "ECOMVISION - Advanced E-commerce Admin Dashboard",
      "description": "A comprehensive full-stack admin dashboard built with MERN stack, featuring real-time analytics, interactive data visualizations, and complete e-commerce management capabilities.",
      "longDescription": "ECOMVISION is a sophisticated business intelligence dashboard designed for e-commerce platforms, providing administrators with powerful tools to monitor and analyze business performance. The application features a modern, responsive interface built with React and Material-UI, offering real-time insights through interactive charts, geographical data visualization, and comprehensive reporting systems.\n\nThe backend leverages Node.js and Express to deliver robust API endpoints, while MongoDB ensures efficient data management.\n\nThe dashboard includes advanced features like multi-role user management, transaction tracking, product analytics, and performance monitoring, making it an essential tool for data-driven decision making in e-commerce operations.",
      "technologies": [
          "React.js",
          "Node.js",
          "Express.js",
          "MongoDB",
          "Material-UI",
          "Redux Toolkit",
          "RTK Query",
          "Nivo Charts",
          "Mongoose ODM"
      ],
      "features": [
          "Real-time business analytics dashboard with KPI tracking",
          "Interactive data visualizations using Nivo charts (bar, line, pie, geographic)",
          "Advanced data grid with sorting, filtering, and pagination capabilities",
          "Geographic user distribution mapping with country-based analytics",
          "Multi-role user management system (user, admin, superadmin)",
          "Comprehensive product management with sales statistics and inventory tracking",
          "Transaction monitoring with search and export functionality",
          "Dark/Light theme switching with responsive design for all devices"
      ],
      "image": "/images/ecomvision1.png",
      "photos": ["/images/ecomvision1.png", "/images/ecomvision2.png", "/images/ecomvision3.png", "/images/ecomvision4.png", "/images/ecomvision5.png", "/images/ecomvision6.png", "/images/ecomvision7.png"],
      "github": "https://github.com/EduardCirstea/Admin-dashboard",
      "demo": "https://www.youtube.com/watch?v=MDAsS329pFI",
      "category": "Full Stack",
      "featured": false,
      "completedAt": "2023-07-15"
    },
    {
      "id": "8",
      "title": "VCRM - Management System",
      "description": "Enterprise-grade workforce management platform for construction and technical services companies, featuring real-time project tracking, team coordination, and automated billing workflows.",
      "longDescription": "A comprehensive backend system built with NestJS that streamlines operations for service-based companies managing multiple teams, vehicles, equipment, and complex projects. The platform handles the complete project lifecycle from client acquisition and contract management to work execution, time tracking, and automated invoicing.\n\nFeatures include GPS-based job locations, multi-level approval workflows, real-time notifications via SMS/Email, document management with cloud storage, and role-based access control for different organizational levels.\n\nThe system supports subcontractor coordination, equipment allocation, vehicle fleet management, and detailed work entry tracking with team lead and admin approval processes.",
      "technologies": [
        "TypeScript", 
          "NestJS",
          "PostgreSQL",
          "Prisma",
          "JWT Authentication",
          "Cloudinary",
          "SendGrid",
          "Twilio"
      ],
      "features": [
          "Multi-role user management with hierarchical permissions (SuperAdmin, Admin, TeamLead, Employee)",
          "Complex project workflow management with 9 distinct status stages from confirmation to billing",
          "GPS-based job location tracking with geofencing capabilities",
          "Real-time work entry tracking with dual-level approval system",
          "Automated notification system via SMS and Email with HTML templates",
          "Cloud-based document management supporting multiple file formats",
          "Fleet and equipment management with user assignment tracking",
          "Integrated CRM with client management, contracts, and subcontractor coordination"
      ],
      "image": "/images/vcrm1.png",
      "photos": ["/images/vcrm1.png"],
      "github": "",
      "demo": "https://vcrm.systemiotech.com/",
      "category": "Backend",
      "featured": false,
      "completedAt": "2025-01-12"
    },
  
    {
      "id": "9",
      "title": "Bolt Relay - Amazon Relay Autobooker Chrome Extension",
     "description": "Advanced Chrome extension with automated booking system for Amazon Relay transportation marketplace using API interception and real-time monitoring.",
    "longDescription": "A sophisticated Chrome extension that automates the booking process on Amazon Relay's transportation marketplace. The system intercepts API calls, processes real-time freight opportunities, and automatically reserves the most profitable loads based on user-defined criteria.\n\nFeatures include JWT authentication, multi-language support, real-time price monitoring, and both manual and automatic booking modes.\n\nBuilt with TypeScript and modern web technologies, the extension integrates seamlessly with Amazon Relay's interface while providing advanced filtering and booking capabilities for transportation companies.",
    "technologies": [
      "HTML5/CSS3",
    "TypeScript",
    "Manifest V3",
    "Webpack",
    "REST API Integration",
    "JWT Authentication",
    "JavaScript Obfuscation",
    "Service Workers"
    ],
     "features": [
    "Real-time API interception and network request modification",
    "Automated freight booking with customizable criteria and filters",
    "JWT-based authentication system with session management",
    "Multi-language support (Romanian, English, French, Dutch)",
    "Real-time price monitoring and opportunity tracking",
    "Progressive 4-step workflow with user guidance",
    "Audio notifications and visual feedback system",
    "Advanced data processing for location and equipment categorization"
    ],  
      "image": "/images/boltextension1.png",
      "photos": ["/images/boltextension1.png", "/images/boltextension2.png", "/images/boltextension3.png"],
      "github": "",
      "demo": "https://youtu.be/ln5EPFspVxE",
      "category": "Full Stack",
      "featured": false,
      "completedAt": "2025-01-12"
    },
    {
      "id": "10",
      "title": "BoltRelay Autobooker Web Page- Amazon Relay Load Automation Platform",
      "description": "Enterprise-grade SaaS platform enabling truck drivers to automate Amazon Relay load bookings with intelligent algorithms, real-time optimization, and comprehensive subscription management.",
      "longDescription": "BoltRelay is a sophisticated full-stack web application that revolutionizes the transportation industry by automating Amazon Relay load bookings for truck drivers and logistics companies. Built with modern technologies and enterprise-grade architecture, the platform features intelligent booking algorithms that work 24/7 to secure the most profitable loads, comprehensive user management with multi-tier subscription plans, and seamless payment processing through Stripe integration.\n\nThe application supports multiple languages, implements GDPR-compliant data protection, and provides real-time monitoring capabilities.\n\nWith its responsive design and intuitive UX, BoltRelay serves as both a marketing platform and a complete user dashboard, enabling drivers to optimize their operations and increase profitability by up to 40% while saving 90% of manual booking time.",
      "technologies": [
          "Next.js 15",
          "React 19",
          "TypeScript",
          "Tailwind CSS 4",
          "Stripe API",
          "i18next",
          "RESTful APIs",
          "JWT Authentication"
      ],
      "features": [
          "Multi-tier SaaS subscription system with Stripe integration",
          "JWT-based authentication with token validation and refresh",
          "Internationalization support for 5 languages (EN, RO, ES, IT, FR)",
          "GDPR-compliant cookie consent and data protection",
          "Real-time user dashboard with subscription management",
          "Responsive design with modern UI/UX patterns",
          "Email verification and password reset workflows",
          "SEO optimization with dynamic meta tags and sitemap generation"
      ],
      "image": "/images/boltweb1.png",
      "photos": ["/images/boltweb1.png", "/images/boltweb2.png", "/images/boltweb3.png", "/images/boltweb4.png", "/images/boltweb5.png", "/images/boltweb6.png"],
      "github": "",
      "demo": "https://boltrelay.systemiotech.com/",
      "category": "Frontend",
      "featured": true,
      "completedAt": "2025-01-12"
    }
   
] 